"""
Your task is to create an N x N spiral matrix with the given size N.

Rules:
+ The spiral should start with the first row filled with 1s, and then proceed clockwise.
+ The spiral path made of 1s must not touch itself, including diagonally.
+ The rest of the cells in the matrix should be filled with 0s.
+ The input size N is guaranteed to be at least 5.

Example:
For N = 5, the output should be:
[[1, 1, 1, 1, 1],
 [0, 0, 0, 0, 1],
 [1, 1, 1, 0, 1],
 [1, 0, 0, 0, 1],
 [1, 1, 1, 1, 1]]

For N = 10, the output should be:
[[1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
 [0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
 [1, 1, 1, 1, 1, 1, 1, 1, 0, 1],
 [1, 0, 0, 0, 0, 0, 0, 1, 0, 1],
 [1, 0, 1, 1, 1, 1, 0, 1, 0, 1],
 [1, 0, 1, 0, 0, 1, 0, 1, 0, 1],
 [1, 0, 1, 0, 0, 0, 0, 1, 0, 1],
 [1, 0, 1, 1, 1, 1, 1, 1, 0, 1],
 [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
 [1, 1, 1, 1, 1, 1, 1, 1, 1, 1]]

Ваша задача — создать спиральную матрицу размера N x N для заданного значения N.

Правила:
+ Спираль начинается с полностью заполненной первой строки (1) и продолжается по часовой стрелке.
+ Путь спирали, состоящий из 1, не должен касаться самого себя, включая диагонали.
+ Остальные клетки матрицы заполняются нулями (0).
+ Размер N гарантированно будет не меньше 5.

Пример:
Для N = 5 результат должен быть:
[[1, 1, 1, 1, 1],
 [0, 0, 0, 0, 1],
 [1, 1, 1, 0, 1],
 [1, 0, 0, 0, 1],
 [1, 1, 1, 1, 1]]

Для N = 10 результат должен быть:
[[1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
 [0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
 [1, 1, 1, 1, 1, 1, 1, 1, 0, 1],
 [1, 0, 0, 0, 0, 0, 0, 1, 0, 1],
 [1, 0, 1, 1, 1, 1, 0, 1, 0, 1],
 [1, 0, 1, 0, 0, 1, 0, 1, 0, 1],
 [1, 0, 1, 0, 0, 0, 0, 1, 0, 1],
 [1, 0, 1, 1, 1, 1, 1, 1, 0, 1],
 [1, 0, 0, 0, 0, 0, 0, 0, 0, 1],
 [1, 1, 1, 1, 1, 1, 1, 1, 1, 1]]

https://www.codewars.com/kata/534e01fbbb17187c7e0000c6
"""